[
  {
    "id": "object-detection",
    "title": "Enhancing Cormas with Computer Vision",
    "img": "etienne-cv.png",
    "supervisors": [
      "Etienne Delay",
      "Oleksandr Zaitsev"
    ],
    "description": "[Cormas](https://github.com/cormas/cormas) is an open-source modeling and multi-agent simulation platform implemented in Pharo and dedicated for management of renewable natural resources. The novelty of Cormas is in its orientation towards the [Companion Modelling](https://www.commod.org/) which suggests the development of interactive games that facilitate the collaborative exploration of scenarios by scientists and local stakeholders.\n\nThe goal of this project is to enhance the interactive functionality of Cormas by building a computer vision system for detecting tangible objects such as board game pieces. Such a system would permit people to play a [serious game](https://en.wikipedia.org/wiki/Serious_game) on a physical board and have a camera detect the movement of pieces and automatically update the Cormas model. The game could then be stored, replayed, interacted with, and analysed using Cormas.\n\nObject detection can be implemented based on the smartphone camera or with a more advanced dedicated tool such as [Azure Kinect](https://azure.microsoft.com/en-us/products/kinect-dk/). Adaptation of Cormas platform for receiving live input from real world is a very important aspect of this project.",
    "goal": "- Implement and test the API in Cormas for positioning agents on the spatial grid\n- Implement a prototype of an object detection system using computer vision\n- Connect the implemented object detection system to Cormas\n- Implement calibration and board initialization",
    "keywords": [
      "Computer Vision",
      "Machine Learning",
      "AI",
      "Agent-Based Modeling"
    ],
    "size": "Large",
    "difficulty": "Hard",
    "skills": {
      "required": [
        "Pharo",
        "Machine Learing"
      ],
      "preferred": [
        "Open CV",
        "Cormas"
      ]
    }
  }
]